## Pandas - Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
weatherForecastDict = {"Ankara": [15, 20, np.nan], "Istanbul": [25, np.nan, 20], "Izmir": [30, 35, 40]}
weatherForecastDataFrame = pd.DataFrame(weatherForecastDict)

In [3]:
weatherForecastDataFrame

   Ankara  Istanbul  Izmir
0    15.0      25.0     30
1    20.0       NaN     35
2     NaN      20.0     40

In [4]:
weatherForecastDataFrame.dropna()

   Ankara  Istanbul  Izmir
0    15.0      25.0     30

In [5]:
weatherForecastDataFrame

   Ankara  Istanbul  Izmir
0    15.0      25.0     30
1    20.0       NaN     35
2     NaN      20.0     40

In [6]:
weatherForecastDataFrame.dropna(axis = 1)

   Izmir
0     30
1     35
2     40

In [7]:
weatherForecastMuDict = {"Ankara": [15, 20, np.nan], "Istanbul": [25, np.nan, 20], "Izmir": [30, 35, 40], "Antalya": [38, np.nan, np.nan]}
weatherForecastMuDataFrame = pd.DataFrame(weatherForecastMuDict)

In [8]:
weatherForecastMuDataFrame

   Ankara  Istanbul  Izmir  Antalya
0    15.0      25.0     30     38.0
1    20.0       NaN     35      NaN
2     NaN      20.0     40      NaN

In [9]:
weatherForecastMuDataFrame.dropna(axis = 1, thresh = 2)

   Ankara  Istanbul  Izmir
0    15.0      25.0     30
1    20.0       NaN     35
2     NaN      20.0     40

In [10]:
weatherForecastMuDataFrame

   Ankara  Istanbul  Izmir  Antalya
0    15.0      25.0     30     38.0
1    20.0       NaN     35      NaN
2     NaN      20.0     40      NaN

In [11]:
weatherForecastMuDataFrame.fillna(1)

   Ankara  Istanbul  Izmir  Antalya
0    15.0      25.0     30     38.0
1    20.0       1.0     35      1.0
2     1.0      20.0     40      1.0

In [12]:
weatherForecastMuDataFrame

   Ankara  Istanbul  Izmir  Antalya
0    15.0      25.0     30     38.0
1    20.0       NaN     35      NaN
2     NaN      20.0     40      NaN

### groupby

In [13]:
priceDict = {"Departman": ["Yazılım", "Yazılım", "Finans", "Finans", "İK", "İK"], "StaffName": ["Ali", "Ece", "Ege", "Özge", "Bilge", "Kerem"], "Salary": [100, 150, 200, 300, 500, 900]}

In [14]:
salaryDataFrame = pd.DataFrame(priceDict)

In [15]:
salaryDataFrame

  Departman StaffName  Salary
0   Yazılım       Ali     100
1   Yazılım       Ece     150
2    Finans       Ege     200
3    Finans      Özge     300
4        İK     Bilge     500
5        İK     Kerem     900

In [16]:
groupObject = salaryDataFrame.groupby("Departman")

In [17]:
groupObject.count()

           StaffName  Salary
Departman
Finans             2       2
Yazılım            2       2
İK                 2       2

In [18]:
groupObject

In [19]:
groupObject.mean()

C:\Users\MBK's EXCALIBUR\AppData\Local\Temp\ipykernel_10332\669412379.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groupObject.mean()

           Salary
Departman
Finans      250.0
Yazılım     125.0
İK          700.0

In [20]:
groupObject.min()

          StaffName  Salary
Departman
Finans          Ege     200
Yazılım         Ali     100
İK            Bilge     500

In [21]:
groupObject.max()

          StaffName  Salary
Departman
Finans         Özge     300
Yazılım         Ece     150
İK            Kerem     900

In [22]:
groupObject.describe()

          Salary
           count   mean         std    min    25%    50%    75%    max
Departman
Finans       2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım      2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0
İK           2.0  700.0  282.842712  500.0  600.0  700.0  800.0  900.0

### concatenation

In [23]:
dict1 = {"Name": ["John", "Jane", "Jessie", "Jordan"], "Sport": ["Jogging", "Swimming", "Tennis", "Gym"], "Kcal": [150, 350, 250, 400]}
dataFrame1 = pd.DataFrame(dict1, index = [0, 1, 2, 3])

In [24]:
dataFrame1

     Name     Sport  Kcal
0    John   Jogging   150
1    Jane  Swimming   350
2  Jessie    Tennis   250
3  Jordan       Gym   400

In [25]:
dict2 = {"Name": ["Alison", "Anne", "Annie", "Andre"], "Sport": ["Running", "Basketball", "Fitness", "Football"], "Kcal": [125, 300, 200, 325]}
dataFrame2 = pd.DataFrame(dict2, index = [4, 5, 6, 7])

In [26]:
dataFrame2

     Name       Sport  Kcal
4  Alison     Running   125
5    Anne  Basketball   300
6   Annie     Fitness   200
7   Andre    Football   325

In [27]:
dict3 = {"Name": ["Sebastian", "Sarah", "Susannah", "Sam"], "Sport": ["Cycling", "Handball", "Pilates", "Yoga"], "Kcal": [335, 345, 195, 155]}
dataFrame3 = pd.DataFrame(dict3, index = [8, 9, 10, 11])

In [28]:
dataFrame3

         Name     Sport  Kcal
8   Sebastian   Cycling   335
9       Sarah  Handball   345
10   Susannah   Pilates   195
11        Sam      Yoga   155

In [29]:
pd.concat([dataFrame1, dataFrame2, dataFrame3], axis = 0)

         Name       Sport  Kcal
0        John     Jogging   150
1        Jane    Swimming   350
2      Jessie      Tennis   250
3      Jordan         Gym   400
4      Alison     Running   125
5        Anne  Basketball   300
6       Annie     Fitness   200
7       Andre    Football   325
8   Sebastian     Cycling   335
9       Sarah    Handball   345
10   Susannah     Pilates   195
11        Sam        Yoga   155

### merge

In [30]:
mDict1 = {"Name": ["Melanie", "Mike", "Monica", "Michael"], "Sport": ["Fencing", "Table Tennis", "Volleyball", "Climbing"]}

In [31]:
mDataFrame1 = pd.DataFrame(mDict1)

In [32]:
mDataFrame1

      Name         Sport
0  Melanie       Fencing
1     Mike  Table Tennis
2   Monica    Volleyball
3  Michael      Climbing

In [33]:
mDict2 = {"Name": ["Melanie", "Mike", "Monica", "Michael"], "Kcal": [375, 350, 325, 300]}

In [34]:
mDataFrame2 = pd.DataFrame(mDict2)

In [35]:
mDataFrame2

      Name  Kcal
0  Melanie   375
1     Mike   350
2   Monica   325
3  Michael   300

In [36]:
pd.merge(mDataFrame1, mDataFrame2, on = "Name")

      Name         Sport  Kcal
0  Melanie       Fencing   375
1     Mike  Table Tennis   350
2   Monica    Volleyball   325
3  Michael      Climbing   300

### Advance

In [37]:
salDict = {"Name": ["Billie", "Bark", "Benny", "Becky"], "Department": ["Software", "Marketing", "Sales", "Software"], "Salary": [2000, 1500, 2100, 2500]}

In [38]:
salDataFrame = pd.DataFrame(salDict)

In [39]:
salDataFrame

     Name Department  Salary
0  Billie   Software    2000
1    Bark  Marketing    1500
2   Benny      Sales    2100
3   Becky   Software    2500

In [40]:
salDataFrame["Department"].unique()

array(['Software', 'Marketing', 'Sales'], dtype=object)

In [41]:
salDataFrame["Department"].nunique()

3

In [42]:
salDataFrame["Department"].value_counts()

Software     2
Marketing    1
Sales        1
Name: Department, dtype: int64

In [43]:
def grossToNet(Salary):
    return Salary * 0.75

In [44]:
salaryDataFrame["Salary"].apply(grossToNet)

0     75.0
1    112.5
2    150.0
3    225.0
4    375.0
5    675.0
Name: Salary, dtype: float64

In [45]:
salaryDataFrame.isnull()

   Departman  StaffName  Salary
0      False      False   False
1      False      False   False
2      False      False   False
3      False      False   False
4      False      False   False
5      False      False   False

In [46]:
newData = {"Character Class": ["South Park", "South Park", "Simpson", "Simpson", "Simpson"], "Character Name": ["Cartman", "Kenny", "Homer", "Bart", "Bart"], "Character Age": [15, 20, 30, 60, 15]}

In [47]:
chaDF = pd.DataFrame(newData)

In [48]:
chaDF

  Character Class Character Name  Character Age
0      South Park        Cartman             15
1      South Park          Kenny             20
2         Simpson          Homer             30
3         Simpson           Bart             60
4         Simpson           Bart             15

In [49]:
chaDF.pivot_table(values = "Character Age", index = ["Character Class", "Character Name"])

                                Character Age
Character Class Character Name
Simpson         Bart                     37.5
                Homer                    30.0
South Park      Cartman                  15.0
                Kenny                    20.0

In [50]:
chaDF.pivot_table(values = "Character Age", index = ["Character Class", "Character Name"], aggfunc = np.sum)

                                Character Age
Character Class Character Name
Simpson         Bart                       75
                Homer                      30
South Park      Cartman                    15
                Kenny                      20

## Excel

In [51]:
dfFromExcel = pd.read_excel("salary.xlsx")

In [52]:
dfFromExcel

  Unnamed: 0  Salary   Age Department
0       Jane      10  25.0   Software
1  Christian      20   NaN      Sales
2      Eddie      30  45.0        Law
3     Phoebe      40  55.0  Marketing
4     Rachel      50  65.0    Finance
5       Ryan      60  75.0        NaN

In [53]:
noNullValue = dfFromExcel.dropna()

In [54]:
noNullValue

  Unnamed: 0  Salary   Age Department
0       Jane      10  25.0   Software
2      Eddie      30  45.0        Law
3     Phoebe      40  55.0  Marketing
4     Rachel      50  65.0    Finance

In [55]:
noNullValue.to_excel("newSalary.xlsx")